; domain
; The domain for our sokoban problem is simply named sokoban
(define (domain sokoban)

; Our sokoban domain declares the most basic subset of PDDL, consisting of STRIPS as the only requirements
(:requirements :strips)

; For our predicates, we'll specify the name and number of arguments used for each
(:predicates
	(navigable ?location)		; Is the location navigatble
	(direction ?direct)			; Is the object a direction
	(block-at ?box ?location)	; Is the box at the given location
	(robot-at ?location)		; Is the robot at the given location
	(block ?box)				; Is the given box a block or crate
	(adjacent ?location1 ?location2 ?direct) 	; Are the two locations adjacent
	(empty ?location)			; Is the location empty or avalable
)

; We'll need to be able to move our robot through locations
(:action move
	
	; To start, we need a from and to location need to be specified
	:parameters
		(?from ?to ?dir)

	; Before we effect the current state, we need to make sure
	; that both the first two given parameters are navigable,
	; the we have infact a direction
	; and that given the the direction
	; that our to location is both reachable (adjacent) and currently empty
	:precondition 
		(and 
			(navigable ?from) 
			(navigable ?to) 
			(direction ?dir) 
			(robot-at ?from) 
			(adjacent ?from ?to ?dir) 
			(empty ?to)
		)

	; The effect on the current state of the world is that
	; the location we previosly ocupied will now be vacant with no robot,
	; the robot now at the "to" location so "to" now ocupied
	:effect 
		(and 
			(empty ?from)
			(robot-at ?to) 
			(not (empty ?to))
			(not (robot-at ?from))
		)
)

; To menipulate boxes, we'll need to have an action to push them
(:action push

	; To start, we need locations of the robot, block, destination
	; plus the corisponding location and block object to be specified
	:parameters
		(?robotLocation ?blockLocation ?freeLocation  ?dirr ?activeBlock)

	; Before we effect the current state, we need to make sure
	; that all the first three given parameters are navigable,
	; and that the block can be pushed into an empty location
	; that is adjacent in the proper location
	:precondition 
		(and 
			(navigable ?robotLocation) 
			(navigable ?blockLocation) 
			(navigable ?freeLocation)          
			(direction ?dirr) 
			(block ?activeBlock) 
			(robot-at ?robotLocation)                   
			(block-at ?activeBlock ?blockLocation) 
			(adjacent ?robotLocation ?blockLocation ?dirr)                   
			(adjacent ?blockLocation ?freeLocation ?dirr) 
			(empty ?freeLocation)
		)

	; The effect on the current state of the world is that
	; the location we previosly ocupied will now be vacant with no robot,
	; the location the box previosly ocupied will now be ocupied by the robot,
	; and the free location will now be occupied by the box
	:effect
		(and 
			(robot-at ?blockLocation) 
			(block-at ?activeBlock ?freeLocation) 
			(empty ?robotLocation)       
			(not (robot-at ?robotLocation)) 
			(not (block-at ?activeBlock ?blockLocation)) 
			(not (empty ?freeLocation))
		)
)

; problem
; XXXXXXX 
; XXX__XX 
; XXXa_XX 
; X_b__rX 
; X_ggg_X 
; XXc__XX 
; XX__XXX 
; XXXXXXX 

; This is an auto generated sokoban problem
(define (problem sokoban_problem )

; The domain for our sokoban problem is simply named sokoban
(:domain sokoban)

; Specify list of objects
(:objects 

; Specify list of directions
up down left right

; Specify list of blocks
a b c 

; Specify list of locations
r0-c0 r0-c1 r0-c2 r0-c3 r0-c4 r0-c5 r0-c6 
r1-c0 r1-c1 r1-c2 r1-c3 r1-c4 r1-c5 r1-c6 
r2-c0 r2-c1 r2-c2 r2-c3 r2-c4 r2-c5 r2-c6 
r3-c0 r3-c1 r3-c2 r3-c3 r3-c4 r3-c5 r3-c6 
r4-c0 r4-c1 r4-c2 r4-c3 r4-c4 r4-c5 r4-c6 
r5-c0 r5-c1 r5-c2 r5-c3 r5-c4 r5-c5 r5-c6 
r6-c0 r6-c1 r6-c2 r6-c3 r6-c4 r6-c5 r6-c6 
r7-c0 r7-c1 r7-c2 r7-c3 r7-c4 r7-c5 r7-c6 

)


; Init direction objects
(:init

; Init direction objects
(direction up)
(direction down)
(direction left)
(direction right)

; Init block objects and locations
(block a)
(block-at a r2-c3)
(block b)
(block-at b r3-c2)
(block c)
(block-at c r5-c2)


; Init robot location
(robot-at r3-c5)

; Init navigable objects
(navigable r1-c3)
(navigable r1-c4)
(navigable r2-c3)
(navigable r2-c4)
(navigable r3-c1)
(navigable r3-c2)
(navigable r3-c3)
(navigable r3-c4)
(navigable r3-c5)
(navigable r4-c1)
(navigable r4-c2)
(navigable r4-c3)
(navigable r4-c4)
(navigable r4-c5)
(navigable r5-c2)
(navigable r5-c3)
(navigable r5-c4)
(navigable r6-c2)
(navigable r6-c3)

; Init empty objects
(empty r1-c3)
(empty r1-c4)
(empty r2-c4)
(empty r3-c1)
(empty r3-c3)
(empty r3-c4)
(empty r4-c1)
(empty r4-c2)
(empty r4-c3)
(empty r4-c4)
(empty r4-c5)
(empty r5-c3)
(empty r5-c4)
(empty r6-c2)
(empty r6-c3)

; Init adjacent objects
(adjacent r0-c0 r1-c0 down) (adjacent r0-c0 r0-c1 right) 
(adjacent r0-c1 r1-c1 down) (adjacent r0-c1 r0-c0 left) (adjacent r0-c1 r0-c2 right) 
(adjacent r0-c2 r1-c2 down) (adjacent r0-c2 r0-c1 left) (adjacent r0-c2 r0-c3 right) 
(adjacent r0-c3 r1-c3 down) (adjacent r0-c3 r0-c2 left) (adjacent r0-c3 r0-c4 right) 
(adjacent r0-c4 r1-c4 down) (adjacent r0-c4 r0-c3 left) (adjacent r0-c4 r0-c5 right) 
(adjacent r0-c5 r1-c5 down) (adjacent r0-c5 r0-c4 left) (adjacent r0-c5 r0-c6 right) 
(adjacent r0-c6 r1-c6 down) (adjacent r0-c6 r0-c5 left) 
(adjacent r1-c0 r0-c0 up) (adjacent r1-c0 r2-c0 down) (adjacent r1-c0 r1-c1 right) 
(adjacent r1-c1 r0-c1 up) (adjacent r1-c1 r2-c1 down) (adjacent r1-c1 r1-c0 left) (adjacent r1-c1 r1-c2 right) 
(adjacent r1-c2 r0-c2 up) (adjacent r1-c2 r2-c2 down) (adjacent r1-c2 r1-c1 left) (adjacent r1-c2 r1-c3 right) 
(adjacent r1-c3 r0-c3 up) (adjacent r1-c3 r2-c3 down) (adjacent r1-c3 r1-c2 left) (adjacent r1-c3 r1-c4 right) 
(adjacent r1-c4 r0-c4 up) (adjacent r1-c4 r2-c4 down) (adjacent r1-c4 r1-c3 left) (adjacent r1-c4 r1-c5 right) 
(adjacent r1-c5 r0-c5 up) (adjacent r1-c5 r2-c5 down) (adjacent r1-c5 r1-c4 left) (adjacent r1-c5 r1-c6 right) 
(adjacent r1-c6 r0-c6 up) (adjacent r1-c6 r2-c6 down) (adjacent r1-c6 r1-c5 left) 
(adjacent r2-c0 r1-c0 up) (adjacent r2-c0 r3-c0 down) (adjacent r2-c0 r2-c1 right) 
(adjacent r2-c1 r1-c1 up) (adjacent r2-c1 r3-c1 down) (adjacent r2-c1 r2-c0 left) (adjacent r2-c1 r2-c2 right) 
(adjacent r2-c2 r1-c2 up) (adjacent r2-c2 r3-c2 down) (adjacent r2-c2 r2-c1 left) (adjacent r2-c2 r2-c3 right) 
(adjacent r2-c3 r1-c3 up) (adjacent r2-c3 r3-c3 down) (adjacent r2-c3 r2-c2 left) (adjacent r2-c3 r2-c4 right) 
(adjacent r2-c4 r1-c4 up) (adjacent r2-c4 r3-c4 down) (adjacent r2-c4 r2-c3 left) (adjacent r2-c4 r2-c5 right) 
(adjacent r2-c5 r1-c5 up) (adjacent r2-c5 r3-c5 down) (adjacent r2-c5 r2-c4 left) (adjacent r2-c5 r2-c6 right) 
(adjacent r2-c6 r1-c6 up) (adjacent r2-c6 r3-c6 down) (adjacent r2-c6 r2-c5 left) 
(adjacent r3-c0 r2-c0 up) (adjacent r3-c0 r4-c0 down) (adjacent r3-c0 r3-c1 right) 
(adjacent r3-c1 r2-c1 up) (adjacent r3-c1 r4-c1 down) (adjacent r3-c1 r3-c0 left) (adjacent r3-c1 r3-c2 right) 
(adjacent r3-c2 r2-c2 up) (adjacent r3-c2 r4-c2 down) (adjacent r3-c2 r3-c1 left) (adjacent r3-c2 r3-c3 right) 
(adjacent r3-c3 r2-c3 up) (adjacent r3-c3 r4-c3 down) (adjacent r3-c3 r3-c2 left) (adjacent r3-c3 r3-c4 right) 
(adjacent r3-c4 r2-c4 up) (adjacent r3-c4 r4-c4 down) (adjacent r3-c4 r3-c3 left) (adjacent r3-c4 r3-c5 right) 
(adjacent r3-c5 r2-c5 up) (adjacent r3-c5 r4-c5 down) (adjacent r3-c5 r3-c4 left) (adjacent r3-c5 r3-c6 right) 
(adjacent r3-c6 r2-c6 up) (adjacent r3-c6 r4-c6 down) (adjacent r3-c6 r3-c5 left) 
(adjacent r4-c0 r3-c0 up) (adjacent r4-c0 r5-c0 down) (adjacent r4-c0 r4-c1 right) 
(adjacent r4-c1 r3-c1 up) (adjacent r4-c1 r5-c1 down) (adjacent r4-c1 r4-c0 left) (adjacent r4-c1 r4-c2 right) 
(adjacent r4-c2 r3-c2 up) (adjacent r4-c2 r5-c2 down) (adjacent r4-c2 r4-c1 left) (adjacent r4-c2 r4-c3 right) 
(adjacent r4-c3 r3-c3 up) (adjacent r4-c3 r5-c3 down) (adjacent r4-c3 r4-c2 left) (adjacent r4-c3 r4-c4 right) 
(adjacent r4-c4 r3-c4 up) (adjacent r4-c4 r5-c4 down) (adjacent r4-c4 r4-c3 left) (adjacent r4-c4 r4-c5 right) 
(adjacent r4-c5 r3-c5 up) (adjacent r4-c5 r5-c5 down) (adjacent r4-c5 r4-c4 left) (adjacent r4-c5 r4-c6 right) 
(adjacent r4-c6 r3-c6 up) (adjacent r4-c6 r5-c6 down) (adjacent r4-c6 r4-c5 left) 
(adjacent r5-c0 r4-c0 up) (adjacent r5-c0 r6-c0 down) (adjacent r5-c0 r5-c1 right) 
(adjacent r5-c1 r4-c1 up) (adjacent r5-c1 r6-c1 down) (adjacent r5-c1 r5-c0 left) (adjacent r5-c1 r5-c2 right) 
(adjacent r5-c2 r4-c2 up) (adjacent r5-c2 r6-c2 down) (adjacent r5-c2 r5-c1 left) (adjacent r5-c2 r5-c3 right) 
(adjacent r5-c3 r4-c3 up) (adjacent r5-c3 r6-c3 down) (adjacent r5-c3 r5-c2 left) (adjacent r5-c3 r5-c4 right) 
(adjacent r5-c4 r4-c4 up) (adjacent r5-c4 r6-c4 down) (adjacent r5-c4 r5-c3 left) (adjacent r5-c4 r5-c5 right) 
(adjacent r5-c5 r4-c5 up) (adjacent r5-c5 r6-c5 down) (adjacent r5-c5 r5-c4 left) (adjacent r5-c5 r5-c6 right) 
(adjacent r5-c6 r4-c6 up) (adjacent r5-c6 r6-c6 down) (adjacent r5-c6 r5-c5 left) 
(adjacent r6-c0 r5-c0 up) (adjacent r6-c0 r7-c0 down) (adjacent r6-c0 r6-c1 right) 
(adjacent r6-c1 r5-c1 up) (adjacent r6-c1 r7-c1 down) (adjacent r6-c1 r6-c0 left) (adjacent r6-c1 r6-c2 right) 
(adjacent r6-c2 r5-c2 up) (adjacent r6-c2 r7-c2 down) (adjacent r6-c2 r6-c1 left) (adjacent r6-c2 r6-c3 right) 
(adjacent r6-c3 r5-c3 up) (adjacent r6-c3 r7-c3 down) (adjacent r6-c3 r6-c2 left) (adjacent r6-c3 r6-c4 right) 
(adjacent r6-c4 r5-c4 up) (adjacent r6-c4 r7-c4 down) (adjacent r6-c4 r6-c3 left) (adjacent r6-c4 r6-c5 right) 
(adjacent r6-c5 r5-c5 up) (adjacent r6-c5 r7-c5 down) (adjacent r6-c5 r6-c4 left) (adjacent r6-c5 r6-c6 right) 
(adjacent r6-c6 r5-c6 up) (adjacent r6-c6 r7-c6 down) (adjacent r6-c6 r6-c5 left) 
(adjacent r7-c0 r6-c0 up) (adjacent r7-c0 r7-c1 right) 
(adjacent r7-c1 r6-c1 up) (adjacent r7-c1 r7-c0 left) (adjacent r7-c1 r7-c2 right) 
(adjacent r7-c2 r6-c2 up) (adjacent r7-c2 r7-c1 left) (adjacent r7-c2 r7-c3 right) 
(adjacent r7-c3 r6-c3 up) (adjacent r7-c3 r7-c2 left) (adjacent r7-c3 r7-c4 right) 
(adjacent r7-c4 r6-c4 up) (adjacent r7-c4 r7-c3 left) (adjacent r7-c4 r7-c5 right) 
(adjacent r7-c5 r6-c5 up) (adjacent r7-c5 r7-c4 left) (adjacent r7-c5 r7-c6 right) 
(adjacent r7-c6 r6-c6 up) (adjacent r7-c6 r7-c5 left) 

; Init Done
)
; Define goal states
(:goal (and 
		(empty r1-c3)
		(empty r1-c4)
		
		(empty r2-c3)
		(empty r2-c4)
		
		(empty r3-c1)
		(empty r3-c2)
		(robot-at r3-c3)
		(empty r3-c4)
		(empty r3-c5)
		
		(empty r4-c1)
		(empty r4-c5)
		
		(empty r5-c2)
		(empty r5-c3)
		(empty r5-c4)
		
		(empty r6-c2)
		(empty r6-c3)
	)
)

; Problem Define Done
)

; plan
1. (move r3-c5 r3-c4 left)
   deleted: (empty r3-c4) (robot-at r3-c5)
   added: (empty r3-c5) (robot-at r3-c4)
   goals met: 11 of 16
2. (move r3-c4 r3-c3 left)
   deleted: (empty r3-c3) (robot-at r3-c4)
   added: (empty r3-c4) (robot-at r3-c3)
   goals met: 13 of 16
3. (move r3-c3 r4-c3 down)
   deleted: (empty r4-c3) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r4-c3)
   goals met: 12 of 16
4. (move r4-c3 r4-c2 left)
   deleted: (empty r4-c2) (robot-at r4-c3)
   added: (empty r4-c3) (robot-at r4-c2)
   goals met: 12 of 16
5. (move r4-c2 r4-c1 left)
   deleted: (empty r4-c1) (robot-at r4-c2)
   added: (empty r4-c2) (robot-at r4-c1)
   goals met: 11 of 16
6. (move r4-c1 r3-c1 up)
   deleted: (empty r3-c1) (robot-at r4-c1)
   added: (empty r4-c1) (robot-at r3-c1)
   goals met: 11 of 16
7. (push r3-c1 r3-c2 r3-c3 right b)
   deleted: (robot-at r3-c1) (block-at b r3-c2) (empty r3-c3)
   added: (robot-at r3-c2) (block-at b r3-c3) (empty r3-c1)
   goals met: 12 of 16
8. (push r3-c2 r3-c3 r3-c4 right b)
   deleted: (robot-at r3-c2) (block-at b r3-c3) (empty r3-c4)
   added: (robot-at r3-c3) (block-at b r3-c4) (empty r3-c2)
   goals met: 13 of 16
9. (move r3-c3 r4-c3 down)
   deleted: (empty r4-c3) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r4-c3)
   goals met: 12 of 16
10. (move r4-c3 r5-c3 down)
   deleted: (empty r5-c3) (robot-at r4-c3)
   added: (empty r4-c3) (robot-at r5-c3)
   goals met: 11 of 16
11. (move r5-c3 r6-c3 down)
   deleted: (empty r6-c3) (robot-at r5-c3)
   added: (empty r5-c3) (robot-at r6-c3)
   goals met: 11 of 16
12. (move r6-c3 r6-c2 left)
   deleted: (empty r6-c2) (robot-at r6-c3)
   added: (empty r6-c3) (robot-at r6-c2)
   goals met: 11 of 16
13. (push r6-c2 r5-c2 r4-c2 up c)
   deleted: (robot-at r6-c2) (block-at c r5-c2) (empty r4-c2)
   added: (robot-at r5-c2) (block-at c r4-c2) (empty r6-c2)
   goals met: 12 of 16
14. (move r5-c2 r5-c3 right)
   deleted: (empty r5-c3) (robot-at r5-c2)
   added: (empty r5-c2) (robot-at r5-c3)
   goals met: 12 of 16
15. (move r5-c3 r4-c3 up)
   deleted: (empty r4-c3) (robot-at r5-c3)
   added: (empty r5-c3) (robot-at r4-c3)
   goals met: 13 of 16
16. (move r4-c3 r3-c3 up)
   deleted: (empty r3-c3) (robot-at r4-c3)
   added: (empty r4-c3) (robot-at r3-c3)
   goals met: 14 of 16
17. (move r3-c3 r3-c2 left)
   deleted: (empty r3-c2) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r3-c2)
   goals met: 12 of 16
18. (move r3-c2 r3-c1 left)
   deleted: (empty r3-c1) (robot-at r3-c2)
   added: (empty r3-c2) (robot-at r3-c1)
   goals met: 12 of 16
19. (move r3-c1 r4-c1 down)
   deleted: (empty r4-c1) (robot-at r3-c1)
   added: (empty r3-c1) (robot-at r4-c1)
   goals met: 12 of 16
20. (push r4-c1 r4-c2 r4-c3 right c)
   deleted: (robot-at r4-c1) (block-at c r4-c2) (empty r4-c3)
   added: (robot-at r4-c2) (block-at c r4-c3) (empty r4-c1)
   goals met: 13 of 16
21. (move r4-c2 r5-c2 down)
   deleted: (empty r5-c2) (robot-at r4-c2)
   added: (empty r4-c2) (robot-at r5-c2)
   goals met: 12 of 16
22. (move r5-c2 r5-c3 right)
   deleted: (empty r5-c3) (robot-at r5-c2)
   added: (empty r5-c2) (robot-at r5-c3)
   goals met: 12 of 16
23. (move r5-c3 r5-c4 right)
   deleted: (empty r5-c4) (robot-at r5-c3)
   added: (empty r5-c3) (robot-at r5-c4)
   goals met: 12 of 16
24. (move r5-c4 r4-c4 up)
   deleted: (empty r4-c4) (robot-at r5-c4)
   added: (empty r5-c4) (robot-at r4-c4)
   goals met: 13 of 16
25. (move r4-c4 r4-c5 right)
   deleted: (empty r4-c5) (robot-at r4-c4)
   added: (empty r4-c4) (robot-at r4-c5)
   goals met: 12 of 16
26. (move r4-c5 r3-c5 up)
   deleted: (empty r3-c5) (robot-at r4-c5)
   added: (empty r4-c5) (robot-at r3-c5)
   goals met: 12 of 16
27. (push r3-c5 r3-c4 r3-c3 left b)
   deleted: (robot-at r3-c5) (block-at b r3-c4) (empty r3-c3)
   added: (robot-at r3-c4) (block-at b r3-c3) (empty r3-c5)
   goals met: 13 of 16
28. (push r3-c4 r3-c3 r3-c2 left b)
   deleted: (robot-at r3-c4) (block-at b r3-c3) (empty r3-c2)
   added: (robot-at r3-c3) (block-at b r3-c2) (empty r3-c4)
   goals met: 14 of 16
29. (move r3-c3 r3-c4 right)
   deleted: (empty r3-c4) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r3-c4)
   goals met: 12 of 16
30. (move r3-c4 r2-c4 up)
   deleted: (empty r2-c4) (robot-at r3-c4)
   added: (empty r3-c4) (robot-at r2-c4)
   goals met: 12 of 16
31. (move r2-c4 r1-c4 up)
   deleted: (empty r1-c4) (robot-at r2-c4)
   added: (empty r2-c4) (robot-at r1-c4)
   goals met: 12 of 16
32. (move r1-c4 r1-c3 left)
   deleted: (empty r1-c3) (robot-at r1-c4)
   added: (empty r1-c4) (robot-at r1-c3)
   goals met: 12 of 16
33. (push r1-c3 r2-c3 r3-c3 down a)
   deleted: (robot-at r1-c3) (block-at a r2-c3) (empty r3-c3)
   added: (robot-at r2-c3) (block-at a r3-c3) (empty r1-c3)
   goals met: 13 of 16
34. (move r2-c3 r2-c4 right)
   deleted: (empty r2-c4) (robot-at r2-c3)
   added: (empty r2-c3) (robot-at r2-c4)
   goals met: 13 of 16
35. (move r2-c4 r3-c4 down)
   deleted: (empty r3-c4) (robot-at r2-c4)
   added: (empty r2-c4) (robot-at r3-c4)
   goals met: 13 of 16
36. (move r3-c4 r4-c4 down)
   deleted: (empty r4-c4) (robot-at r3-c4)
   added: (empty r3-c4) (robot-at r4-c4)
   goals met: 14 of 16
37. (move r4-c4 r5-c4 down)
   deleted: (empty r5-c4) (robot-at r4-c4)
   added: (empty r4-c4) (robot-at r5-c4)
   goals met: 13 of 16
38. (move r5-c4 r5-c3 left)
   deleted: (empty r5-c3) (robot-at r5-c4)
   added: (empty r5-c4) (robot-at r5-c3)
   goals met: 13 of 16
39. (move r5-c3 r5-c2 left)
   deleted: (empty r5-c2) (robot-at r5-c3)
   added: (empty r5-c3) (robot-at r5-c2)
   goals met: 13 of 16
40. (move r5-c2 r4-c2 up)
   deleted: (empty r4-c2) (robot-at r5-c2)
   added: (empty r5-c2) (robot-at r4-c2)
   goals met: 14 of 16
41. (push r4-c2 r4-c3 r4-c4 right c)
   deleted: (robot-at r4-c2) (block-at c r4-c3) (empty r4-c4)
   added: (robot-at r4-c3) (block-at c r4-c4) (empty r4-c2)
   goals met: 14 of 16
42. (push r4-c3 r3-c3 r2-c3 up a)
   deleted: (robot-at r4-c3) (block-at a r3-c3) (empty r2-c3)
   added: (robot-at r3-c3) (block-at a r2-c3) (empty r4-c3)
   goals met: 14 of 16
43. (move r3-c3 r3-c4 right)
   deleted: (empty r3-c4) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r3-c4)
   goals met: 12 of 16
44. (move r3-c4 r2-c4 up)
   deleted: (empty r2-c4) (robot-at r3-c4)
   added: (empty r3-c4) (robot-at r2-c4)
   goals met: 12 of 16
45. (move r2-c4 r1-c4 up)
   deleted: (empty r1-c4) (robot-at r2-c4)
   added: (empty r2-c4) (robot-at r1-c4)
   goals met: 12 of 16
46. (move r1-c4 r1-c3 left)
   deleted: (empty r1-c3) (robot-at r1-c4)
   added: (empty r1-c4) (robot-at r1-c3)
   goals met: 12 of 16
47. (push r1-c3 r2-c3 r3-c3 down a)
   deleted: (robot-at r1-c3) (block-at a r2-c3) (empty r3-c3)
   added: (robot-at r2-c3) (block-at a r3-c3) (empty r1-c3)
   goals met: 13 of 16
48. (push r2-c3 r3-c3 r4-c3 down a)
   deleted: (robot-at r2-c3) (block-at a r3-c3) (empty r4-c3)
   added: (robot-at r3-c3) (block-at a r4-c3) (empty r2-c3)
   goals met: 15 of 16
49. (push r3-c3 r4-c3 r5-c3 down a)
   deleted: (robot-at r3-c3) (block-at a r4-c3) (empty r5-c3)
   added: (robot-at r4-c3) (block-at a r5-c3) (empty r3-c3)
   goals met: 13 of 16
50. (move r4-c3 r4-c2 left)
   deleted: (empty r4-c2) (robot-at r4-c3)
   added: (empty r4-c3) (robot-at r4-c2)
   goals met: 13 of 16
51. (move r4-c2 r4-c1 left)
   deleted: (empty r4-c1) (robot-at r4-c2)
   added: (empty r4-c2) (robot-at r4-c1)
   goals met: 12 of 16
52. (move r4-c1 r3-c1 up)
   deleted: (empty r3-c1) (robot-at r4-c1)
   added: (empty r4-c1) (robot-at r3-c1)
   goals met: 12 of 16
53. (push r3-c1 r3-c2 r3-c3 right b)
   deleted: (robot-at r3-c1) (block-at b r3-c2) (empty r3-c3)
   added: (robot-at r3-c2) (block-at b r3-c3) (empty r3-c1)
   goals met: 13 of 16
54. (move r3-c2 r4-c2 down)
   deleted: (empty r4-c2) (robot-at r3-c2)
   added: (empty r3-c2) (robot-at r4-c2)
   goals met: 14 of 16
55. (move r4-c2 r4-c3 right)
   deleted: (empty r4-c3) (robot-at r4-c2)
   added: (empty r4-c2) (robot-at r4-c3)
   goals met: 14 of 16
56. (push r4-c3 r3-c3 r2-c3 up b)
   deleted: (robot-at r4-c3) (block-at b r3-c3) (empty r2-c3)
   added: (robot-at r3-c3) (block-at b r2-c3) (empty r4-c3)
   goals met: 14 of 16
57. (move r3-c3 r3-c4 right)
   deleted: (empty r3-c4) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r3-c4)
   goals met: 12 of 16
58. (move r3-c4 r3-c5 right)
   deleted: (empty r3-c5) (robot-at r3-c4)
   added: (empty r3-c4) (robot-at r3-c5)
   goals met: 12 of 16
59. (move r3-c5 r4-c5 down)
   deleted: (empty r4-c5) (robot-at r3-c5)
   added: (empty r3-c5) (robot-at r4-c5)
   goals met: 12 of 16
60. (push r4-c5 r4-c4 r4-c3 left c)
   deleted: (robot-at r4-c5) (block-at c r4-c4) (empty r4-c3)
   added: (robot-at r4-c4) (block-at c r4-c3) (empty r4-c5)
   goals met: 13 of 16
61. (push r4-c4 r4-c3 r4-c2 left c)
   deleted: (robot-at r4-c4) (block-at c r4-c3) (empty r4-c2)
   added: (robot-at r4-c3) (block-at c r4-c2) (empty r4-c4)
   goals met: 13 of 16
62. (move r4-c3 r4-c4 right)
   deleted: (empty r4-c4) (robot-at r4-c3)
   added: (empty r4-c3) (robot-at r4-c4)
   goals met: 13 of 16
63. (move r4-c4 r5-c4 down)
   deleted: (empty r5-c4) (robot-at r4-c4)
   added: (empty r4-c4) (robot-at r5-c4)
   goals met: 12 of 16
64. (push r5-c4 r5-c3 r5-c2 left a)
   deleted: (robot-at r5-c4) (block-at a r5-c3) (empty r5-c2)
   added: (robot-at r5-c3) (block-at a r5-c2) (empty r5-c4)
   goals met: 12 of 16
65. (move r5-c3 r4-c3 up)
   deleted: (empty r4-c3) (robot-at r5-c3)
   added: (empty r5-c3) (robot-at r4-c3)
   goals met: 13 of 16
66. (move r4-c3 r3-c3 up)
   deleted: (empty r3-c3) (robot-at r4-c3)
   added: (empty r4-c3) (robot-at r3-c3)
   goals met: 14 of 16
67. (move r3-c3 r3-c2 left)
   deleted: (empty r3-c2) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r3-c2)
   goals met: 12 of 16
68. (move r3-c2 r3-c1 left)
   deleted: (empty r3-c1) (robot-at r3-c2)
   added: (empty r3-c2) (robot-at r3-c1)
   goals met: 12 of 16
69. (move r3-c1 r4-c1 down)
   deleted: (empty r4-c1) (robot-at r3-c1)
   added: (empty r3-c1) (robot-at r4-c1)
   goals met: 12 of 16
70. (push r4-c1 r4-c2 r4-c3 right c)
   deleted: (robot-at r4-c1) (block-at c r4-c2) (empty r4-c3)
   added: (robot-at r4-c2) (block-at c r4-c3) (empty r4-c1)
   goals met: 13 of 16
71. (push r4-c2 r4-c3 r4-c4 right c)
   deleted: (robot-at r4-c2) (block-at c r4-c3) (empty r4-c4)
   added: (robot-at r4-c3) (block-at c r4-c4) (empty r4-c2)
   goals met: 13 of 16
72. (move r4-c3 r5-c3 down)
   deleted: (empty r5-c3) (robot-at r4-c3)
   added: (empty r4-c3) (robot-at r5-c3)
   goals met: 12 of 16
73. (move r5-c3 r6-c3 down)
   deleted: (empty r6-c3) (robot-at r5-c3)
   added: (empty r5-c3) (robot-at r6-c3)
   goals met: 12 of 16
74. (move r6-c3 r6-c2 left)
   deleted: (empty r6-c2) (robot-at r6-c3)
   added: (empty r6-c3) (robot-at r6-c2)
   goals met: 12 of 16
75. (push r6-c2 r5-c2 r4-c2 up a)
   deleted: (robot-at r6-c2) (block-at a r5-c2) (empty r4-c2)
   added: (robot-at r5-c2) (block-at a r4-c2) (empty r6-c2)
   goals met: 13 of 16
76. (move r5-c2 r5-c3 right)
   deleted: (empty r5-c3) (robot-at r5-c2)
   added: (empty r5-c2) (robot-at r5-c3)
   goals met: 13 of 16
77. (move r5-c3 r4-c3 up)
   deleted: (empty r4-c3) (robot-at r5-c3)
   added: (empty r5-c3) (robot-at r4-c3)
   goals met: 14 of 16
78. (move r4-c3 r3-c3 up)
   deleted: (empty r3-c3) (robot-at r4-c3)
   added: (empty r4-c3) (robot-at r3-c3)
   goals met: 15 of 16
79. (move r3-c3 r3-c4 right)
   deleted: (empty r3-c4) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r3-c4)
   goals met: 13 of 16
80. (move r3-c4 r2-c4 up)
   deleted: (empty r2-c4) (robot-at r3-c4)
   added: (empty r3-c4) (robot-at r2-c4)
   goals met: 13 of 16
81. (move r2-c4 r1-c4 up)
   deleted: (empty r1-c4) (robot-at r2-c4)
   added: (empty r2-c4) (robot-at r1-c4)
   goals met: 13 of 16
82. (move r1-c4 r1-c3 left)
   deleted: (empty r1-c3) (robot-at r1-c4)
   added: (empty r1-c4) (robot-at r1-c3)
   goals met: 13 of 16
83. (push r1-c3 r2-c3 r3-c3 down b)
   deleted: (robot-at r1-c3) (block-at b r2-c3) (empty r3-c3)
   added: (robot-at r2-c3) (block-at b r3-c3) (empty r1-c3)
   goals met: 14 of 16
84. (push r2-c3 r3-c3 r4-c3 down b)
   deleted: (robot-at r2-c3) (block-at b r3-c3) (empty r4-c3)
   added: (robot-at r3-c3) (block-at b r4-c3) (empty r2-c3)
   goals met: 16 of 16
